import pickle
import pandas as pd
from datetime import datetime
from config import *
import pickle
from collections import defaultdict
import re

# 加载数据
with open(f"../{DATASET_DIR}/icd10_order_{EXCLUDE_DAY}_{'_'.join(TARGET_PATTERN)}.pkl", "rb") as f:
    date_dict = pickle.load(f)



# 提取ICD-10编码的大类
def get_icd10_category(icd10_code,level=None):
    # 移除可能存在的空格
    icd10_code = icd10_code.strip()
    # 定义不同level的正则表达式模式
    patterns = {
        3: r'([A-Z]\d{2})',
        4: r'([A-Z]\d{2}\.[0-9X])',
    }
    # 获取指定level的模式，如果level不在预定义范围内，使用最接近的level
    pattern = patterns[level]
    # 尝试匹配模式
    match = re.match(pattern, icd10_code, re.IGNORECASE)
    # 如果匹配成功，返回匹配的部分；否则返回原始编码
    return match.group(1).upper() if match else icd10_code.upper()
def map_icd10_to_chapter(icd10_code,level=None):
    # 移除空格并转换为大写
    code = icd10_code.strip().upper()

    # 定义ICD-10章节范围
    chapters = [
        ('A00', 'B99', 1),  # I   某些传染病和寄生虫病
        ('C00', 'D48', 2),  # II  肿瘤
        ('D50', 'D89', 3),  # III 血液及造血器官疾病和某些涉及免疫机制的疾病
        ('E00', 'E90', 4),  # IV  内分泌、营养和代谢疾病
        ('F00', 'F99', 5),  # V   精神和行为障碍
        ('G00', 'G99', 6),  # VI  神经系统疾病
        ('H00', 'H59', 7),  # VII 眼和附器疾病
        ('H60', 'H95', 8),  # VIII耳和乳突疾病
        ('I00', 'I99', 9),  # IX  循环系统疾病
        ('J00', 'J99', 10),  # X   呼吸系统疾病
        ('K00', 'K93', 11),  # XI  消化系统疾病
        ('L00', 'L99', 12),  # XII 皮肤和皮下组织疾病
        ('M00', 'M99', 13),  # XIII肌肉骨骼系统和结缔组织疾病
        ('N00', 'N99', 14),  # XIV 泌尿生殖系统疾病
        ('O00', 'O99', 15),  # XV  妊娠、分娩和产褥期
        ('P00', 'P96', 16),  # XVI 某些起源于围生期的情况
        ('Q00', 'Q99', 17),  # XVII先天性畸形、变形和染色体异常
        ('R00', 'R99', 18),  # XVIII症状、体征和临床与实验室异常所见，不可归类在他处者
        ('S00', 'T98', 19),  # XIX 损伤、中毒和某些其他外因所致的后果
        ('V01', 'Y98', 20),  # XX  疾病和死亡的外部原因
        ('Z00', 'Z99', 21),  # XXI 影响健康状态和与保健机构接触的因素
        ('U00', 'U99', 22)  # XXII特殊目的代码
    ]

    # 提取编码的前三个字符（章节标识符）
    chapter_code = code[:3]

    # 查找对应的章节
    for start, end, chapter_num in chapters:
        if start <= chapter_code <= end:
            return chapter_num

    # 如果没有找到匹配的章节，返回None或抛出异常
    raise ValueError(f"ICD-10编码{code}没有匹配的章节")
def map_icd10_to_block(icd10_code, level=None):
    # 移除空格并转换为大写
    code = icd10_code.strip().upper()
    # ICD-10类别映射
    # ICD-10类别映射
    categories = [
        ('A00', 'A09', 1),  # 肠道传染病
        ('A15', 'A19', 2),  # 肺结核
        ('A20', 'A28', 3),  # 某些动物传染的细菌性疾病
        ('A30', 'A49', 4),  # 其他细菌性疾病
        ('A50', 'A64', 5),  # 主要为性传播模式的感染
        ('A65', 'A69', 6),  # 其他螺旋体疾病
        ('A70', 'A74', 7),  # 其他由衣原体引起的疾病
        ('A75', 'A79', 8),  # 斑点热立克次体病
        ('A80', 'A89', 9),  # 中枢神经系统病毒感染
        ('A90', 'A99', 10),  # 由节枝动物传播的病毒热和病毒性出血热
        ('B00', 'B09', 11),  # 以皮肤和黏膜损害为特征的病毒性感染
        ('B15', 'B19', 12),  # 病毒性肝炎
        ('B20', 'B24', 13),  # 人类免疫缺陷病毒（HIV）性疾病
        ('B25', 'B34', 14),  # 其他病毒性疾病
        ('B35', 'B49', 15),  # 真菌病
        ('B50', 'B64', 16),  # 原虫病
        ('B65', 'B83', 17),  # 蠕虫病
        ('B85', 'B89', 18),  # 虱病，螨病和其他虫害
        ('B90', 'B94', 19),  # 传染病和寄生虫病的后遗症
        ('B95', 'B98', 20),  # 细菌、病毒和其他感染因子
        ('B99', 'B99', 21),  # 其它传染病
        ('C00', 'C97', 22),  # 恶性肿瘤
        ('C00', 'C75', 23),  # 除了淋巴、造血和相关组织之外，有明确部位的，确定为或推测为原发性的恶性肿瘤
        ('C00', 'C14', 24),  # 唇、口腔和咽部的恶性肿瘤
        ('C15', 'C26', 25),  # 消化器官恶性肿瘤
        ('C30', 'C39', 26),  # 呼吸和胸内器官的恶性肿瘤
        ('C40', 'C41', 27),  # 骨和关节软骨恶性肿瘤
        ('C43', 'C44', 28),  # 黑素瘤和其它的皮肤恶性肿瘤
        ('C45', 'C49', 29),  # 间皮和软组织的恶性肿瘤
        ('C50', 'C50', 30),  # 乳房的恶性肿瘤
        ('C51', 'C58', 31),  # 女性生殖器官的恶性肿瘤
        ('C60', 'C63', 32),  # 男性生殖器官的恶性肿瘤
        ('C64', 'C68', 33),  # 泌尿道恶性肿瘤
        ('C69', 'C72', 34),  # 眼、脑和其它中枢神经系统的恶性肿瘤
        ('C73', 'C75', 35),  # 甲状腺和其它内分泌腺恶性肿瘤
        ('C76', 'C80', 36),  # 不明确、继发和未特指部位的恶性肿瘤
        ('C81', 'C96', 37),  # 淋巴、造血和相关组织的恶性肿瘤
        ('C97', 'C97', 38),  # 独立（原发性）的多部位恶性肿瘤
        ('D00', 'D09', 39),  # 原位肿瘤
        ('D10', 'D36', 40),  # 良性肿瘤
        ('D37', 'D48', 41),  # 特性未定或未知肿瘤
        ('D50', 'D53', 42),  # 营养性贫血
        ('D55', 'D59', 43),  # 溶血性贫血
        ('D60', 'D64', 44),  # 再生障碍性贫血和其他的贫血
        ('D65', 'D69', 45),  # 凝血缺陷、紫癜和其他出血性疾病
        ('D70', 'D77', 46),  # 血液和造血器官的其他疾病
        ('D80', 'D89', 47),  # 某些涉及免疫机能的异常
        ('E00', 'E07', 48),  # 甲状腺疾病
        ('E10', 'E14', 49),  # 糖尿病

        ('E15', 'E16', 50),  # 糖调节和胰腺内分泌的其他疾病
        ('E20', 'E35', 51),  # 其他内分泌腺疾病
        ('E40', 'E46', 52),  # 营养不良
        ('E50', 'E64', 53),  # 其他的营养缺乏
        ('E65', 'E68', 54),  # 肥胖和其他的营养过剩
        ('E70', 'E90', 55),  # 代谢性疾病
        ('F00', 'F09', 56),  # 器质性（包括症状性）精神障碍
        ('F10', 'F19', 57),  # 使用精神活性物质所致的精神和行为障碍
        ('F20', 'F29', 58),  # 精神分裂症、分裂型和妄想性精神障碍
        ('F30', 'F39', 59),  # 情感性精神障碍（心境障碍）
        ('F40', 'F48', 60),  # 神经症性、应激性和躯体形式障碍
        ('F50', 'F59', 61),  # 伴有生理障碍和躯体因素的行为综合征
        ('F60', 'F69', 62),  # 成人人格与行为障碍
        ('F70', 'F79', 63),  # 精神发育迟缓
        ('F80', 'F89', 64),  # 心理发育障碍
        ('F90', 'F98', 65),  # 通常发生于儿童及青少年期的行为和精神障碍
        ('F99', 'F99', 66),  # 精神障碍 NOS
        ('G00', 'G09', 67),  # 中枢神经系统炎症性疾病
        ('G10', 'G14', 68),  # 主要影响中枢神经系统的全身性萎缩
        ('G20', 'G26', 69),  # 锥体外运动障碍
        ('G30', 'G32', 70),  # 其它的神经系统变性疾病
        ('G35', 'G37', 71),  # 中枢神经系统脱髓鞘疾病
        ('G40', 'G47', 72),  # 短暂和突发性疾病
        ('G50', 'G59', 73),  # 神经、神经根和神经丛疾病
        ('G60', 'G64', 74),  # 多发性神经病变和其他周围神经系统疾病
        ('G70', 'G73', 75),  # 肌神经接点和肌肉疾病
        ('G80', 'G83', 76),  # 脑瘫和其它的瘫痪综合症
        ('G90', 'G99', 77),  # 其它神经系统疾病
        ('H00', 'H06', 78),  # 眼睑、泪腺系统和眼眶疾病
        ('H10', 'H13', 79),  # 眼结膜疾病
        ('H15', 'H22', 80),  # 巩膜、角膜、虹膜和睫状体疾病
        ('H25', 'H28', 81),  # 晶状体疾病
        ('H30', 'H36', 82),  # 脉胳膜、视网膜疾病
        ('H40', 'H42', 83),  # 青光眼
        ('H43', 'H45', 84),  # 玻璃体和眼球疾病
        ('H46', 'H48', 85),  # 视神经和视通路疾病
        ('H49', 'H52', 86),  # 眼肌、双眼运动、眼睛调节和屈光异常
        ('H53', 'H54', 87),  # 视觉障碍和失明
        ('H55', 'H59', 88),  # 眼及附器的其它疾病
        ('H60', 'H62', 89),  # 外耳疾病
        ('H65', 'H75', 90),  # 中耳和乳突疾病
        ('H80', 'H83', 91),  # 内耳疾病
        ('H90', 'H95', 92),  # 其它耳病
        ('I00', 'I02', 93),  # 急性风湿热
        ('I05', 'I09', 94),  # 慢性风湿性心脏病
        ('I10', 'I15', 95),  # 高血压病
        ('I20', 'I25', 96),  # 缺血性心脏病
        ('I26', 'I28', 97),  # 肺心病和肺循环疾病
        ('I30', 'I52', 98),  # 其它形式的心脏病
        ('I60', 'I69', 99),  # 脑血管疾病

        ('I70', 'I79', 100),  # 动脉、小动脉和毛细血管疾病
        ('I80', 'I89', 101),  # 静脉、淋巴管、淋巴结疾病 NEC
        ('I95', 'I99', 102),  # 其它或未特指的循环系统疾病
        ('J00', 'J99', 103),  # 呼吸系统疾病
        ('J00', 'J06', 104),  # 急性上呼吸道感染
        ('J09', 'J18', 105),  # 流感和肺炎
        ('J20', 'J22', 106),  # 其它急性下呼吸道感染
        ('J30', 'J39', 107),  # 其它上呼吸道疾病
        ('J40', 'J47', 108),  # 慢性下呼吸道疾病
        ('J60', 'J70', 109),  # 由于外部原因造成的肺疾病
        ('J80', 'J84', 110),  # 其它主要影响肺间质的呼吸道疾病
        ('J85', 'J86', 111),  # 下呼吸道化脓性和坏死性疾病
        ('J90', 'J94', 112),  # 其它胸膜疾病
        ('J95', 'J99', 113),  # 其它呼吸系统疾病
        ('K00', 'K14', 114),  # 口腔、唾液腺和上下颌疾病
        ('K20', 'K31', 115),  # 食管、胃和十二指肠疾病
        ('K35', 'K38', 116),  # 阑尾疾病
        ('K40', 'K46', 117),  # 疝气
        ('K50', 'K52', 118),  # 非感染性肠炎和结肠炎
        ('K55', 'K64', 119),  # 其它肠道疾病
        ('K65', 'K67', 120),  # 腹膜疾病
        ('K70', 'K77', 121),  # 肝脏疾病
        ('K80', 'K87', 122),  # 胆囊、胆道和胰腺疾病
        ('K90', 'K93', 123),  # 其它消化系统疾病
        ('L00', 'L08', 124),  # 皮肤和皮下组织感染
        ('L10', 'L14', 125),  # 大疱性皮肤病
        ('L20', 'L30', 126),  # 皮炎和湿疹
        ('L40', 'L45', 127),  # 银屑病
        ('L50', 'L54', 128),  # 风疹和红斑
        ('L55', 'L59', 129),  # 与辐射有关的皮肤和皮下组织疾病
        ('L60', 'L75', 130),  # 皮肤附器疾病
        ('L80', 'L99', 131),  # 其它皮肤和皮下组织疾病
        ('M00', 'M25', 132),  # 关节病
        ('M00', 'M03', 133),  # 感染性关节病
        ('M05', 'M14', 134),  # 炎性多发性关节病变
        ('M15', 'M19', 135),  # 关节病
        ('M20', 'M25', 136),  # 其它关节疾患
        ('M30', 'M36', 137),  # 全身性结缔组织疾病
        ('M40', 'M54', 138),  # 脊背病变
        ('M40', 'M43', 139),  # 背部变形病变
        ('M45', 'M49', 140),  # 脊椎病
        ('M50', 'M54', 141),  # 其它背部病变
        ('M60', 'M79', 142),  # 软组织病变
        ('M60', 'M63', 143),  # 肌肉疾患
        ('M65', 'M68', 144),  # 滑膜和腱的疾患
        ('M70', 'M79', 145),  # 其他软组织疾病
        ('M80', 'M94', 146),  # 骨病和软骨病
        ('M80', 'M85', 147),  # 骨密度和构造疾患
        ('M86', 'M90', 148),  # 其他骨病
        ('M91', 'M94', 149),  # 软骨病变

        ('M95', 'M99', 150),  # 其它骨胳肌肉系统和结缔组织疾病
        ('N00', 'N08', 151),  # 肾小球疾病
        ('N10', 'N16', 152),  # 肾小管-间质疾病
        ('N17', 'N19', 153),  # 肾衰竭
        ('N20', 'N23', 154),  # 尿石症
        ('N25', 'N29', 155),  # 其它肾和输尿管疾病
        ('N30', 'N39', 156),  # 其它泌尿系统疾病
        ('N40', 'N51', 157),  # 男性生殖器官疾病
        ('N60', 'N64', 158),  # 乳房疾病
        ('N70', 'N77', 159),  # 女性盆腔器官炎性疾病
        ('N80', 'N98', 160),  # 女性生殖道非炎性疾病
        ('N99', 'N99', 161),  # 泌尿生殖道的其它疾病
        ('O00', 'O08', 162),  # 伴有流产后果的妊娠
        ('O10', 'O16', 163),  # 在妊娠、分娩和产褥期发生的浮肿、蛋白尿和高血压异常
        ('O20', 'O29', 164),  # 主要与妊娠相关的其它母体异常
        ('O30', 'O48', 165),  # 主要与胎儿、羊膜腔和可能的分娩问题相关的母体护理
        ('O60', 'O75', 166),  # 生产及分娩并发症
        ('O80', 'O84', 167),  # 分娩
        ('O85', 'O92', 168),  # 主要与产褥期相关的并发症
        ('O94', 'O99', 169),  # 其它产科疾病 NEC
        ('P00', 'P04', 170),  # 胎儿和新生儿受母体因素和妊娠、分娩及生产并发症的影响
        ('P05', 'P08', 171),  # 与妊娠周期和胎儿生长相关的疾病
        ('P10', 'P15', 172),  # 产伤
        ('P20', 'P29', 173),  # 特发于围生期的呼吸道和心血管疾病
        ('P35', 'P39', 174),  # 特发于围生期的感染
        ('P50', 'P61', 175),  # 胎儿和新生儿出血和血液疾病
        ('P70', 'P74', 176),  # 特发于胎儿和新生儿的短暂的内分泌和代谢性疾病
        ('P75', 'P78', 177),  # 胎儿和新生儿消化系统疾病
        ('P80', 'P83', 178),  # 涉及胎儿、新生儿体被和体温调节的疾病
        ('P90', 'P96', 179),  # 起源于围生期的其它疾病
        ('Q00', 'Q07', 180),  # 神经系统先天性畸形
        ('Q10', 'Q18', 181),  # 面、耳、眼、颈部先天性畸形
        ('Q20', 'Q28', 182),  # 循环系统先天性畸形
        ('Q30', 'Q34', 183),  # 呼吸系统先天性畸形
        ('Q35', 'Q37', 184),  # 唇裂和颚裂
        ('Q38', 'Q45', 185),  # 其它的消化系统先天性畸形
        ('Q50', 'Q56', 186),  # 生殖器官先天性畸形
        ('Q60', 'Q64', 187),  # 泌尿系统先天性畸形
        ('Q65', 'Q79', 188),  # 肌肉骨胳系统先天性畸形和变形
        ('Q80', 'Q89', 189),  # 其它先天性畸形
        ('Q90', 'Q99', 190),  # 染色体异常 NEC
        ('R00', 'R09', 191),  # 涉及循环和呼吸系统的症状和体征
        ('R10', 'R19', 192),  # 涉及消化系统和腹部的症状和体征
        ('R20', 'R23', 193),  # 涉及皮肤和皮下组织的症状和体征
        ('R25', 'R29', 194),  # 涉及神经和骨胳肌肉系统的症状和体征
        ('R30', 'R39', 195),  # 涉及泌尿系统的症状和体征
        ('R40', 'R46', 196),  # 涉及认识，知觉，情感状态和行为的症状和体征
        ('R47', 'R49', 197),  # 涉及语言和声音的症状和体征
        ('R50', 'R69', 198),  # 一般的症状和体征

        ('R70', 'R79', 199),  # 没有诊断的在验血中的异常发现
        ('R80', 'R82', 200),  # 没有诊断的在验尿中的异常发现
        ('R83', 'R89', 201),  # 没有诊断的在查验其它体液、物质和组织时的异常发现
        ('R90', 'R94', 202),  # 没有诊断的在诊断成像和功能研究中的异常发现
        ('R95', 'R99', 203),  # 界定不清和原因不明的死亡
        ('S00', 'S09', 204),  # 头部损伤
        ('S10', 'S19', 205),  # 颈部损伤
        ('S20', 'S29', 206),  # 胸部损伤
        ('S30', 'S39', 207),  # 腹部，腰脊柱，背下部，盆骨损伤
        ('S40', 'S49', 208),  # 肩部和上臂损伤
        ('S50', 'S59', 209),  # 肘和前臂损伤
        ('S60', 'S69', 210),  # 手和腕部损伤
        ('S70', 'S79', 211),  # 臀和大腿损伤
        ('S80', 'S89', 212),  # 膝和小腿损伤
        ('S90', 'S99', 213),  # 踝和足损伤
        ('T00', 'T07', 214),  # 涉及多处身体部位的损伤
        ('T08', 'T14', 215),  # 未界定的躯干，四肢，或身体部位的损伤
        ('T15', 'T19', 216),  # 通过自然孔口进入的异物的影响
        ('T20', 'T32', 217),  # 烧伤和腐蚀
        ('T20', 'T25', 218),  # 身体外表面的烧伤和腐蚀伤，用部位来表示
        ('T26', 'T28', 219),  # 局限于眼部和内脏器官的烧伤和腐蚀
        ('T29', 'T32', 220),  # 多部位和未界定区域的烧伤和腐蚀
        ('T33', 'T35', 221),  # 冻伤
        ('T36', 'T50', 222),  # 药物，药剂和生物物质引起的中毒
        ('T51', 'T65', 223),  # 主要来源于非医源性物质的毒性作用
        ('T66', 'T78', 224),  # 其它的和未界定的外因影响
        ('T79', 'T79', 225),  # 某些创伤造成的早期并发症
        ('T80', 'T88', 226),  # 手术和医疗护理并发症 NEC
        ('T90', 'T98', 227),  # 损伤，中毒和其它外因后果的后遗症
        ('V01', 'X59', 228),  # 事故
        ('V01', 'V99', 229),  # 交通事故
        ('V01', 'V09', 230),  # 交通事故中的行人受伤
        ('V10', 'V19', 231),  # 骑脚踏车者在交通事故中的受伤
        ('V20', 'V29', 232),  # 交通事故中摩托车手受伤
        ('V30', 'V39', 233),  # 交通事故中的三轮机动车乘用者受伤
        ('V40', 'V49', 234),  # 交通事故中小汽车乘坐者受伤
        ('V50', 'V59', 235),  # 交通事故中皮卡小货车或蓬车的乘坐者受伤
        ('V60', 'V69', 236),  # 交通事故中的重型运输车辆乘坐者受伤
        ('V70', 'V79', 237),  # 交通事故中的公共汽车乘坐者受伤
        ('V80', 'V89', 238),  # 其它的陆地交通事故
        ('V90', 'V94', 239),  # 水上交通事故
        ('V95', 'V97', 240),  # 航空和太空交通事故
        ('V98', 'V99', 241),  # 其它和未特指交通事故
        ('W00', 'W19', 242),  # 跌落
        ('W20', 'W49', 243),  # 暴露于无生命的机械力
        ('W50', 'W64', 244),  # 暴露于有生命的机械力
        ('W65', 'W74', 245),  # 意外溺水和淹没
        ('W75', 'W84', 246),  # 威胁呼吸的其它意外事件
        ('W85', 'W99', 247),  # 暴露在电流、辐射和极端的周围空气温度和压力下
        ('X00', 'X09', 248),  # 暴露于烟、火和火焰
        ('X10', 'X19', 249),  # 与热和烫的物质接触
        ('X20', 'X29', 250),  # 与有毒动植物接触
        ('X30', 'X39', 251),  # 暴露于自然力
        ('X40', 'X49', 252),  # 有害物质造成的意外中毒
        ('X50', 'X57', 253),  # 用力过度，旅行和(生活必需品的)匮乏
        ('X58', 'X59', 254),  # 意外暴露于其它和未特指因素
        ('X60', 'X84', 255),  # 故意的自我伤害
        ('X85', 'Y09', 256),  # 攻击(加害）
        ('Y10', 'Y34', 257),  # 意图不确定的事件
        ('Y35', 'Y36', 258),  # 法律干涉和战争行动
        ('Y40', 'Y84', 259),  # 医疗和手术护理的并发症
        ('Y40', 'Y59', 260),  # 在治疗中引起不良反应的药物、药剂或生物制剂
        ('Y60', 'Y69', 261),  # 患者在手术和医疗护理中的不幸遭遇
        ('Y70', 'Y82', 262),  # 与诊断和治疗中不良事件相关的医疗器械
        ('Y83', 'Y84', 263),  # 在处置期间并未提及事故，但却被作为病人异常反应或稍后并发症原因的手术和医疗处置
        ('Y85', 'Y89', 264),  # 发病和死亡外因造成的后遗症
        ('Y90', 'Y98', 265),  # 与分类在它处的发病和死亡外因有关的补充因素
        ('Z00', 'Z13', 266),  # 因体检和检查接受健康服务的人群
        ('Z20', 'Z29', 267),  # 存在与传染病相关的潜在健康危险的人群
        ('Z30', 'Z39', 268),  # 因生育接受健康服务的人群
        ('Z40', 'Z54', 269),  # 因特殊操作和护理接受健康服务的人群
        ('Z55', 'Z65', 270),  # 存在与社会经济和社会心理状况有关的潜在健康危险的人群
        ('Z70', 'Z76', 271),  # 其它环境条件下接受健康服务的人群
        ('Z80', 'Z99', 272),  # 存在与家庭和个人经历以及某些影响健康状况条件有关的潜在健康危险的人群
        ('U00', 'U79', 273),  # 不确定病因的新疾病的临时编排
        ('U80', 'U89', 274),  # 抵抗抗生素的细菌因子
    ]




    # 提取编码的前三个字符（章节标识符）
    block_code = code[:3]

    # 查找对应的章节
    for start, end, chapter_num in categories:
        if start <= block_code <= end:
            return chapter_num

    # 如果没有找到匹配的章节，返回None或抛出异常
    raise ValueError(f"ICD-10编码{code}没有匹配的块")




# 为每个级别创建类别和ID映射
category_to_id_all_levels = {}

for level in range(1, LEVEL + 1):
    if level == 1:
        get_category = map_icd10_to_chapter
    elif level == 2:
        get_category = map_icd10_to_block
    else:
        get_category = get_icd10_category

    # 收集并排序所有疾病类别
    all_disease_categories = sorted(
        {get_category(disease,level) for diseases in date_dict.values() for disease in diseases})

    # 为每个疾病类别分配一个唯一的编号
    category_to_id = {category: idx + 1 for idx, category in enumerate(all_disease_categories)}
    category_to_id_all_levels[level] = category_to_id

    # 打印疾病类别及其编号
    print(f"Disease Categories and their IDs for Level {level}:")
    for category, category_id in category_to_id.items():
        print(f"Category: {category}, ID: {category_id}")

# 将疾病列表转换为对应的编号列表，每个患者有四个级别的子列表
date_dict_with_ids = {}
for patient_id, diseases in date_dict.items():
    patient_diseases = [[] for _ in range(LEVEL)]
    for disease in diseases:
        for level in range(1, LEVEL + 1):
            if level == 1:
                get_category = map_icd10_to_chapter
            elif level == 2:
                get_category = map_icd10_to_block
            else:
                get_category = get_icd10_category

            category = get_category(disease, level)
            patient_diseases[level - 1].append(category_to_id_all_levels[level][category])
    date_dict_with_ids[patient_id] = patient_diseases




# 求出每个级别的最大长度，并填充到最大长度
# max_lengths = [max(len(patient[i]) for patient in date_dict_with_ids.values()) for i in range(LEVEL)]
# for patient_id, diseases in date_dict_with_ids.items():
#     for i in range(LEVEL):
#         date_dict_with_ids[patient_id][i] += [0] * (max_lengths[i] - len(diseases[i]))




# # 为每个疾病分配一个唯一的编号
# disease_to_id = {disease: idx+1 for idx, disease in enumerate(all_diseases)}
# # 将疾病列表转换为对应的编号列表
# date_dict_with_ids = {
#     patient_id: [disease_to_id[disease] for disease in diseases]
#     for patient_id, diseases in date_dict.items()
# }






# 打印疾病大类及其编号
print("Disease Categories and their IDs:")
for category, category_id in category_to_id.items():
    print(f"Category: {category}, ID: {category_id}")

# 保存疾病到ID的映射
with open(f"../{DATASET_DIR}/dis2id_{EXCLUDE_DAY}_{'_'.join(TARGET_PATTERN)}_{LEVEL}.pkl", "wb") as f:
    pickle.dump(category_to_id, f)

# 保存带有编号的患者数据
with open(f"../{DATASET_DIR}/patient_dis2id_{EXCLUDE_DAY}_{'_'.join(TARGET_PATTERN)}_{LEVEL}.pkl", "wb") as f:
    pickle.dump(date_dict_with_ids, f)


